import math


def theFirst():
    print("\n--- Перше завдання ---")
    a = 5
    x = int(input("Введіть x: "))
    if x > 1:
        return f"y = {math.sqrt(a + math.log10(x)):.3f}"

    if abs(x) < 1:
        return f"y = {math.asinh(x):.3f}"

    return f"y = {x**a:.3f}"


def theSecond():
    print("\n--- Друге завдання ---")
    students = {
        1: "Біян Вікторія Тарасівна",
        2: "Боднар Даніл Олександрович",
        3: "Василів Максим Романович",
        4: "Глинка Тарас Володимирович",
        5: "Гнідець Єлизавета Миколаївна",
        6: "Головенко Михайло Володимирович",
        7: "Горбаль Юрій Ігорович",
        8: "Гузій Андрій Андрійович",
        9: "Данчевський Богдан Васильович",
        10: "Денисюк Данііл Віталійович",
        11: "Заболотний Олег Тарасович",
        12: "Здебеляк Уляна Юріївна",
        13: "Знайкевич Олег Володимирович",
        14: "Качор Євген Андрійович",
        15: "Козік Максим Вадимович",
        16: "Кохан Лев Маркович",
        17: "Кривішин Руслан Петрович",
        18: "Матіяшек Юрій Володимирович",
        19: "Млечко Віталій Степанович",
        20: "Млечко Михайло Віталійович",
        21: "Одарчук Олексій Русланович",
        22: "Потебенько Денис Владиславович",
        23: "Рибак Ярина Михайлівна",
        24: "Сичик Анастасія Євгенівна",
        25: "Скоциляк Юрій Романович",
        26: "Урбан Володимир Володимирович",
        27: "Хім'як Дмитро Богданович",
        28: "Чабря Данило Романович",
        29: "Чайковська Елізабетта",
        30: "Щигол Остап Андрійович",
    }
    number = int(input("Введіть номер студента: "))
    return (
        f"Студент з номером {number} - {students[number]}"
        if number in students
        else "У нас в групі немає такого студента"
    )


def main():
    print("--- Варіант 21 ---")
    print(theFirst())
    print(theSecond())


if __name__ == "__main__":
    main()
